GopalSaraf/Practicals/PSDL/include/proc/pic16f17125.h
extern volatile PWM2ERSbits_t PWM2ERSbits __at(0x50C);
// bitfield macros
#define _PWM2ERS_ERS_POSN                                   0x0
#define _PWM2ERS_ERS_POSITION                               0x0
#define _PWM2ERS_ERS_SIZE                                   0x8
#define _PWM2ERS_ERS_LENGTH                                 0x8
#define _PWM2ERS_ERS_MASK                                   0xFF
#define _PWM2ERS_ERS0_POSN                                  0x0
#define _PWM2ERS_ERS0_POSITION                              0x0
#define _PWM2ERS_ERS0_SIZE                                  0x1
#define _PWM2ERS_ERS0_LENGTH                                0x1
#define _PWM2ERS_ERS0_MASK                                  0x1
#define _PWM2ERS_ERS1_POSN                                  0x1
#define _PWM2ERS_ERS1_POSITION                              0x1
#define _PWM2ERS_ERS1_SIZE                                  0x1
#define _PWM2ERS_ERS1_LENGTH                                0x1
#define _PWM2ERS_ERS1_MASK                                  0x2
#define _PWM2ERS_ERS2_POSN                                  0x2
#define _PWM2ERS_ERS2_POSITION                              0x2
#define _PWM2ERS_ERS2_SIZE                                  0x1
#define _PWM2ERS_ERS2_LENGTH                                0x1
#define _PWM2ERS_ERS2_MASK                                  0x4
#define _PWM2ERS_ERS3_POSN                                  0x3
#define _PWM2ERS_ERS3_POSITION                              0x3
#define _PWM2ERS_ERS3_SIZE                                  0x1
#define _PWM2ERS_ERS3_LENGTH                                0x1
#define _PWM2ERS_ERS3_MASK                                  0x8

// Register: PWM2CLK
#define PWM2CLK PWM2CLK
extern volatile unsigned char           PWM2CLK             __at(0x50D);
#ifndef _LIB_BUILD
asm("PWM2CLK equ 050Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} PWM2CLKbits_t;
extern volatile PWM2CLKbits_t PWM2CLKbits __at(0x50D);
// bitfield macros
#define _PWM2CLK_CLK_POSN                                   0x0
#define _PWM2CLK_CLK_POSITION                               0x0
#define _PWM2CLK_CLK_SIZE                                   0x8
#define _PWM2CLK_CLK_LENGTH                                 0x8
#define _PWM2CLK_CLK_MASK                                   0xFF
#define _PWM2CLK_CLK0_POSN                                  0x0
#define _PWM2CLK_CLK0_POSITION                              0x0
#define _PWM2CLK_CLK0_SIZE                                  0x1
#define _PWM2CLK_CLK0_LENGTH                                0x1
#define _PWM2CLK_CLK0_MASK                                  0x1
#define _PWM2CLK_CLK1_POSN                                  0x1
#define _PWM2CLK_CLK1_POSITION                              0x1
#define _PWM2CLK_CLK1_SIZE                                  0x1
#define _PWM2CLK_CLK1_LENGTH                                0x1
#define _PWM2CLK_CLK1_MASK                                  0x2
#define _PWM2CLK_CLK2_POSN                                  0x2
#define _PWM2CLK_CLK2_POSITION                              0x2
#define _PWM2CLK_CLK2_SIZE                                  0x1
#define _PWM2CLK_CLK2_LENGTH                                0x1
#define _PWM2CLK_CLK2_MASK                                  0x4
#define _PWM2CLK_CLK3_POSN                                  0x3
#define _PWM2CLK_CLK3_POSITION                              0x3
#define _PWM2CLK_CLK3_SIZE                                  0x1
#define _PWM2CLK_CLK3_LENGTH                                0x1
#define _PWM2CLK_CLK3_MASK                                  0x8

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
extern volatile unsigned char           PWM2LDS             __at(0x50E);
#ifndef _LIB_BUILD
asm("PWM2LDS equ 050Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
    };
} PWM2LDSbits_t;
extern volatile PWM2LDSbits_t PWM2LDSbits __at(0x50E);
// bitfield macros
#define _PWM2LDS_LDS_POSN                                   0x0
#define _PWM2LDS_LDS_POSITION                               0x0
#define _PWM2LDS_LDS_SIZE                                   0x8
#define _PWM2LDS_LDS_LENGTH                                 0x8
#define _PWM2LDS_LDS_MASK                                   0xFF
#define _PWM2LDS_LDS0_POSN                                  0x0
#define _PWM2LDS_LDS0_POSITION                              0x0
#define _PWM2LDS_LDS0_SIZE                                  0x1
#define _PWM2LDS_LDS0_LENGTH                                0x1
#define _PWM2LDS_LDS0_MASK                                  0x1
#define _PWM2LDS_LDS1_POSN                                  0x1
#define _PWM2LDS_LDS1_POSITION                              0x1
#define _PWM2LDS_LDS1_SIZE                                  0x1
#define _PWM2LDS_LDS1_LENGTH                                0x1
#define _PWM2LDS_LDS1_MASK                                  0x2
#define _PWM2LDS_LDS2_POSN                                  0x2
#define _PWM2LDS_LDS2_POSITION                              0x2
#define _PWM2LDS_LDS2_SIZE                                  0x1
#define _PWM2LDS_LDS2_LENGTH                                0x1
#define _PWM2LDS_LDS2_MASK                                  0x4

// Register: PWM2PR
#define PWM2PR PWM2PR
extern volatile unsigned short          PWM2PR              __at(0x50F);
#ifndef _LIB_BUILD
asm("PWM2PR equ 050Fh");
#endif

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
extern volatile unsigned char           PWM2PRL             __at(0x50F);
#ifndef _LIB_BUILD
asm("PWM2PRL equ 050Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM2PRLbits_t;
